CSI API ETABS v1
cSapModel.GetDatabaseUnits_2 Method
 Retrieves the database units for the model. All data is internally stored in the model in these units and converted to the present units as needed.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDatabaseUnits_2(
	ref eForce forceUnits,
	ref eLength lengthUnits,
	ref eTemperature temperatureUnits
)
Function GetDatabaseUnits_2 (
	ByRef forceUnits As eForce,
	ByRef lengthUnits As eLength,
	ByRef temperatureUnits As eTemperature
) As Integer
Dim instance As cSapModel
Dim forceUnits As eForce
Dim lengthUnits As eLength
Dim temperatureUnits As eTemperature
Dim returnValue As Integer
returnValue = instance.GetDatabaseUnits_2(forceUnits,
	lengthUnits, temperatureUnits)
int GetDatabaseUnits_2(
	eForce% forceUnits,
	eLength% lengthUnits,
	eTemperature% temperatureUnits
)
abstract GetDatabaseUnits_2 :
        forceUnits : eForce byref *
        lengthUnits : eLength byref *
        temperatureUnits : eTemperature byref -> int
Parameters
forceUnits
Type: ETABSv1.eForce
 A value from the eForce enumeration
lengthUnits
Type: ETABSv1.eLength
 A value from the eLength enumeration
temperatureUnits
Type: ETABSv1.eTemperature
 A value from the eTemperature enumeration
Return Value
Type: Int32
 Returns zero if the units are successfully retrieved, otherwise returns nonzero
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get database units
       Dim forceUnits As eForce
       Dim lengthUnits As eLength
       Dim temperatureUnits As eTemperature
       ret = SapModel.GetDatabaseUnits_2(forceUnits, lengthUnits, temperatureUnits)
   'run model (this will create the analysis model)
       ret = SapModel.Analyze.RunAnalysis
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cSapModel Interface
ETABSv1 Namespace